### SQL in 10 Minutes
#### Lesson III
`where` filter with wildcard and search pattern

In [1]:
import sqlite3 
import pandas as pd

In [2]:
db = 'tysql.sqlite'
conn = sqlite3.connect(db)

In [3]:
tables = pd.read_sql("""SELECT * FROM sqlite_master WHERE type = 'table';""", conn)
tables

,type,name,tbl_name,rootpage,sql
0,table,Customers,Customers,2,CREATE TABLE Customers\n(\n cust_id char...
1,table,OrderItems,OrderItems,4,CREATE TABLE OrderItems\n(\n order_num int ...
2,table,Orders,Orders,7,CREATE TABLE Orders\n(\n order_num int ...
3,table,Products,Products,10,CREATE TABLE Products\n(\n prod_id char(10...
4,table,Vendors,Vendors,12,CREATE TABLE Vendors\n(\n vend_id char(1...

Now we start to use `AND` & `OR` operator.

In [4]:
sql = """
        select prod_id, prod_name, prod_price
        from Products
        where vend_id = 'DLL01' and prod_price <= 4;
        """

In [5]:
ex1 = pd.read_sql_query(sql, conn)
ex1.head()

  prod_id            prod_name  prod_price
0  BNBG01    Fish bean bag toy        3.49
1  BNBG02    Bird bean bag toy        3.49
2  BNBG03  Rabbit bean bag toy        3.49

In [6]:
sql = """
        select prod_name, prod_price
        from Products
        where vend_id = 'DLL01' or vend_id = 'BRS01';
        """

In [8]:
ex2 = pd.read_sql_query(sql, conn)
ex2

             prod_name  prod_price
0    8 inch teddy bear        5.99
1   12 inch teddy bear        8.99
2   18 inch teddy bear       11.99
3    Fish bean bag toy        3.49
4    Bird bean bag toy        3.49
5  Rabbit bean bag toy        3.49
6          Raggedy Ann        4.99

The order of `OR` and `AND`.

In [9]:
sql = """
        select prod_name, prod_price
        from Products
        where vend_id = 'DLL01' or vend_id = 'BRS01' and prod_price >= 10;
        """

In [10]:
ex3 = pd.read_sql_query(sql, conn)
ex3

             prod_name  prod_price
0   18 inch teddy bear       11.99
1    Fish bean bag toy        3.49
2    Bird bean bag toy        3.49
3  Rabbit bean bag toy        3.49
4          Raggedy Ann        4.99

From the above example, we see that the system translate the sql into something like: 

`where vend_id = 'DLL01' or [vend_id = 'BRS01' and prod_price >= 10]`

Modify it correctly as:

In [11]:
sql = """
        select prod_name, prod_price
        from Products
        where (vend_id = 'DLL01' or vend_id = 'BRS01') and prod_price >= 10;
        """

In [12]:
ex4 = pd.read_sql_query(sql, conn)
ex4

            prod_name  prod_price
0  18 inch teddy bear       11.99

Operator `IN`

In [13]:
sql = """
        select prod_name, prod_price
        from Products
        where vend_id in ('DLL01', 'BRS01')
        order by prod_name;
        """

In [14]:
ex5 = pd.read_sql_query(sql, conn)
ex5

             prod_name  prod_price
0   12 inch teddy bear        8.99
1   18 inch teddy bear       11.99
2    8 inch teddy bear        5.99
3    Bird bean bag toy        3.49
4    Fish bean bag toy        3.49
5  Rabbit bean bag toy        3.49
6          Raggedy Ann        4.99

`IN ()` is the same as `OR`

In [15]:
sql = """
        select prod_name
        from Products
        where not vend_id = 'DLL01'
        order by prod_name;
        """

In [16]:
ex6 = pd.read_sql_query(sql, conn)
ex6

            prod_name
0  12 inch teddy bear
1  18 inch teddy bear
2   8 inch teddy bear
3           King doll
4          Queen doll

In [17]:
sql = """
        select prod_id, prod_name
        from Products
        where prod_name like '%Fish%';
        """

In [18]:
ex7 = pd.read_sql_query(sql, conn)
ex7

  prod_id          prod_name
0  BNBG01  Fish bean bag toy

In [19]:
sql = """
        select prod_id, prod_name
        from Products
        where prod_name like '%bean bag%';
        """

In [20]:
ex8 = pd.read_sql_query(sql, conn)
ex8

  prod_id            prod_name
0  BNBG01    Fish bean bag toy
1  BNBG02    Bird bean bag toy
2  BNBG03  Rabbit bean bag toy

In [21]:
sql = """
        select prod_name
        from Products
        where prod_name like 'F%y';
        """

In [22]:
ex9 = pd.read_sql_query(sql, conn)
ex9

           prod_name
0  Fish bean bag toy

See below the function of operator `_`

In [27]:
sql = """
        select prod_name
        from Products
        where prod_name like '_ inch%';
        """

In [28]:
ex10 = pd.read_sql_query(sql, conn)
ex10

           prod_name
0  8 inch teddy bear

In [29]:
sql = """
        select prod_name
        from Products
        where prod_name like '__ inch%';
        """

In [30]:
ex11 = pd.read_sql_query(sql, conn)
ex11

            prod_name
0  12 inch teddy bear
1  18 inch teddy bear

In [31]:
sql = """
        select prod_name
        from Products
        where prod_name like '%inch%';
        """

In [32]:
ex12 = pd.read_sql_query(sql, conn)
ex12

            prod_name
0   8 inch teddy bear
1  12 inch teddy bear
2  18 inch teddy bear

Operator `[]`